Revit 2027 API
FilterRule.GetRuleParameter Method
 Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetRuleParameter()
Public Function GetRuleParameter As ElementId
public:
ElementId^ GetRuleParameter()
member GetRuleParameter : unit -> ElementId
Return Value
ElementId
 The parameter id if there is an associated parameter, or invalidElementId if not.
See Also
Reference
FilterRule Class
Autodesk.Revit.DB Namespace